In [1]:
import pandas as pd
import numpy as np

In [2]:
# 81.导入并查看pandas与numpy版本

In [3]:
pd.__version__

'1.5.3'

In [4]:
np.__version__

'1.24.3'

In [5]:
# 82.从NumPy数组创建DataFrame

In [35]:
df1 = pd.DataFrame(np.random.randint(1, 100, 20))
df1.head()

    0
0  95
1  21
2  73
3  17
4   5

In [7]:
# 83.从NumPy数组创建DataFrame

In [36]:
df2 = pd.DataFrame(np.arange(0, 100, 5))
df2.head()

    0
0   0
1   5
2  10
3  15
4  20

In [16]:
# 84.从NumPy数组创建DataFrame

In [37]:
df3 = pd.DataFrame(np.random.normal(0, 1, 20))
df3.head()

          0
0 -0.829688
1 -0.364701
2  1.166119
3 -0.199348
4 -1.754328

In [18]:
# 85.将df1，df2，df3按照行合并为新DataFrame

In [39]:
df = pd.concat([df1, df2, df3], axis=0, ignore_index=True)
df.head()

      0
0  95.0
1  21.0
2  73.0
3  17.0
4   5.0

In [23]:
# 86.将df1，df2，df3按照列合并为新DataFrame

In [41]:
df = pd.concat([df1, df2, df3], axis=1, ignore_index=True)
df.head()

    0   1         2
0  95   0 -0.829688
1  21   5 -0.364701
2  73  10  1.166119
3  17  15 -0.199348
4   5  20 -1.754328

In [25]:
# 87.查看df所有数据的最小值、25%分位数、中位数、75%分位数、最大值

### percentile

In [42]:
np.percentile(df, q=[0, 25, 50, 75, 100])
# df.describe()

array([-1.75432775,  0.38573847, 18.5       , 55.        , 95.        ])

In [31]:
# 88.修改列名为col1,col2,col3

In [44]:
df.columns = ['col1', 'col2', 'col3']
df.head()

   col1  col2      col3
0    95     0 -0.829688
1    21     5 -0.364701
2    73    10  1.166119
3    17    15 -0.199348
4     5    20 -1.754328

In [45]:
# 89.提取第一列中不在第二列出现的数字

**取反符号~。**

In [49]:
df['col1'][~df['col1'].isin(df['col2'])]

1     21
2     73
3     17
5     72
6      3
7     88
8      7
9     64
10    32
11    69
14    11
15     8
17    46
18    23
Name: col1, dtype: int64

In [50]:
# 90.提取第一列和第二列出现频率最高的三个数字

In [57]:
concat_valuee = pd.concat([df['col1'],df['col2']], axis=0, ignore_index=True)
concat_valuee.value_counts(ascending=False)[:3]

95    2
35    2
5     2
dtype: int64

In [58]:
# 91.提取第一列中可以整除5的数字位置

In [60]:
df['col1'][df['col1'] % 5 == 0].index

Int64Index([0, 4, 12, 13, 16, 19], dtype='int64')

In [62]:
# 92.计算第一列数字前一个与后一个的差值

### diff() 计算df中俩个元素比较差值，默认是和前一行的差值
- periods 和前几行比较，默认1
- axis 0行 1列

In [66]:
df['col1'].diff(periods=1)

0      NaN
1    -74.0
2     52.0
3    -56.0
4    -12.0
5     67.0
6    -69.0
7     85.0
8    -81.0
9     57.0
10   -32.0
11    37.0
12   -19.0
13     5.0
14   -44.0
15    -3.0
16    27.0
17    11.0
18   -23.0
19     7.0
Name: col1, dtype: float64

In [67]:
# 93.将col1,col2,clo3三列顺序颠倒

**1.iloc取整列，2.iloc支持切片，3.切片语法::-1反向遍历**

In [69]:
df.iloc[:, ::-1]

        col3  col2  col1
0  -0.829688     0    95
1  -0.364701     5    21
2   1.166119    10    73
3  -0.199348    15    17
4  -1.754328    20     5
5  -0.754576    25    72
6  -0.162605    30     3
7   0.752303    35    88
8  -0.364649    40     7
9  -1.085725    45    64
10 -0.473475    50    32
11  0.888568    55    69
12  1.537629    60    50
13  0.496224    65    55
14 -0.204440    70    11
15  1.051888    75     8
16  0.039231    80    35
17  0.008655    85    46
18 -0.991091    90    23
19  0.054283    95    30

In [70]:
# 94.提取第一列位置在1,10,15的数字

**iloc[[行索引]，[列索引]]**

In [74]:
df.iloc[[1, 10, 15], [0]]

    col1
1     21
10    32
15     8

**Series.take([])获取多值**

In [75]:
df['col1'].take([1, 10, 15])

1     21
10    32
15     8
Name: col1, dtype: int64

In [76]:
# 95.查找第一列的局部最大值位置

In [77]:
# 局部最大：即比它前一个与后一个数字的都大的数字

In [78]:
# 96.按行计算df的每一行均值

In [80]:
df.mean(axis=1)

0     31.390104
1      8.545100
2     28.055373
3     10.600217
4      7.748557
5     32.081808
6     10.945798
7     41.250768
8     15.545117
9     35.971425
10    27.175508
11    41.629523
12    37.179210
13    40.165408
14    26.931853
15    28.017296
16    38.346410
17    43.669552
18    37.336303
19    41.684761
dtype: float64

In [81]:
# 97.对第二列计算移动平均值

In [82]:
# 98.将数据按照第三列值的大小升序排列

In [85]:
df.sort_values(by=['col3'], ascending=True, inplace=True)
df

    col1  col2      col3
4      5    20 -1.754328
9     64    45 -1.085725
18    23    90 -0.991091
0     95     0 -0.829688
5     72    25 -0.754576
10    32    50 -0.473475
1     21     5 -0.364701
8      7    40 -0.364649
14    11    70 -0.204440
3     17    15 -0.199348
6      3    30 -0.162605
17    46    85  0.008655
16    35    80  0.039231
19    30    95  0.054283
13    55    65  0.496224
7     88    35  0.752303
11    69    55  0.888568
15     8    75  1.051888
2     73    10  1.166119
12    50    60  1.537629

In [86]:
# 99.将第一列大于50的数字修改为'高'

In [89]:
df['col1'][df['col1'] > 50] = '高'

/var/folders/b4/glz9zwj572q15bxbv_pxjymm0000gn/T/ipykernel_3268/517033731.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['col1'][df['col1'] > 50] = '高'

In [90]:
df

   col1  col2      col3
4     5    20 -1.754328
9     高    45 -1.085725
18   23    90 -0.991091
0     高     0 -0.829688
5     高    25 -0.754576
10   32    50 -0.473475
1    21     5 -0.364701
8     7    40 -0.364649
14   11    70 -0.204440
3    17    15 -0.199348
6     3    30 -0.162605
17   46    85  0.008655
16   35    80  0.039231
19   30    95  0.054283
13    高    65  0.496224
7     高    35  0.752303
11    高    55  0.888568
15    8    75  1.051888
2     高    10  1.166119
12   50    60  1.537629

In [91]:
# 100.计算第二列与第三列之间的欧式距离

In [ ]:
# 101.从CSV文件中读取指定数据

#### read_csv
- usecols： 指定读取的列
- nrows： 指定读取的行数
- converters: 指定规则进行操作

In [94]:
temp = pd.read_csv('../data/movie.csv', usecols=['director_name', 'duration', 'actor_2_name'], nrows=5)
temp

       director_name  duration      actor_2_name
0      James Cameron     178.0  Joel David Moore
1     Gore Verbinski     169.0     Orlando Bloom
2         Sam Mendes     148.0      Rory Kinnear
3  Christopher Nolan     164.0    Christian Bale
4        Doug Walker       NaN        Rob Walker

In [92]:
# 102.从CSV文件中读取指定数据
# 从数据2中读取数据并在读取数据时将薪资大于10000的为改为高

In [96]:
df = pd.read_csv('../data/movie.csv',converters={'duration': lambda x: '高' if x and float(x) > 120 else '低'} )
df.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,高,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,高,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,高,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,高,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,低,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

In [97]:
# 103.从上一题数据中，对薪资水平列每隔20行进行一次抽样？

In [101]:
df.iloc[::20, :][['duration']]

     duration
0           高
20          高
40          高
60          高
80          高
...       ...
4820        低
4840        低
4860        低
4880        低
4900        低

[246 rows x 1 columns]

In [102]:
# 104.将数据取消使用科学计数法

In [103]:
df = pd.DataFrame(np.random.random(10)**10, columns=['data'])
df

           data
0  1.230924e-02
1  3.990303e-08
2  7.696895e-07
3  5.776293e-16
4  2.605003e-08
5  4.891297e-03
6  7.331929e-02
7  5.837922e-04
8  6.434632e-09
9  4.241504e-01

In [105]:
# 四舍五入
df.round(3)

    data
0  0.012
1  0.000
2  0.000
3  0.000
4  0.000
5  0.005
6  0.073
7  0.001
8  0.000
9  0.424

In [106]:
# 105.将上一题的数据转换为百分数

In [107]:
df.style.format({'data': '{0:.2%}'.format})

In [108]:
# 106.查找上一题数据中第3大值的行号

In [120]:
df['data'].sort_values().take([2])

4    2.605003e-08
Name: data, dtype: float64

In [121]:
# 107.反转df的行

In [123]:
df.iloc[::-1, :]

           data
9  4.241504e-01
8  6.434632e-09
7  5.837922e-04
6  7.331929e-02
5  4.891297e-03
4  2.605003e-08
3  5.776293e-16
2  7.696895e-07
1  3.990303e-08
0  1.230924e-02

In [136]:
# 108.merge合并 交集inner
df1= pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
'key2': ['K0', 'K1', 'K0', 'K1'],
'A': ['A0', 'A1', 'A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3']})

df2= pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
'key2': ['K0', 'K0', 'K0', 'K0'],
'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']})

In [127]:
df1

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [128]:
df2

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [130]:
pd.merge(df1, df2, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [135]:
# 108.merge合并 outer并集

In [134]:
pd.merge(df1, df2, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [137]:
# 109.merge left

In [138]:
pd.merge(df1, df2, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [139]:
# 109.merge right

In [140]:
pd.merge(df1, df2, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [147]:
# 111.查找xxx相等的行号

**np.where(bool)查询行号**

In [143]:
# 113.数据的salary列开根号

**1、开根号函数np.sqrt;2、使用自定义函数apply**

In [150]:
# 114.数据按x拆分

**df[].str可以直接转为字符串，然后使用字符串的功能**

In [151]:
# 117.按列制作数据透视表

In [ ]:
### pivot_table

In [152]:
df = pd.read_csv('../data/movie.csv')
df.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

In [155]:
# 假如第一步我们想知道按照导演的的数据

In [154]:
pd.pivot_table(df, index=['director_name'])

/var/folders/b4/glz9zwj572q15bxbv_pxjymm0000gn/T/ipykernel_3268/3091202946.py:1: FutureWarning: pivot_table dropped a column because it failed to aggregate. This behavior is deprecated and will raise in a future version of pandas. Select only the columns that can be aggregated.
  pd.pivot_table(df, index=['director_name'])

,actor_1_facebook_likes,actor_2_facebook_likes,actor_3_facebook_likes,aspect_ratio,budget,cast_total_facebook_likes,director_facebook_likes,duration,facenumber_in_poster,gross,imdb_score,movie_facebook_likes,num_critic_for_reviews,num_user_for_reviews,num_voted_users,title_year
director_name,,,,,,,,,,,,,,,,
A. Raven Cruz,639.0,361.0,94.0,1.78,1000000.0,1188.0,0.0,97.0,2.0,NaN,1.9,128.0,3.0,9.0,534.0,2005.0
Aaron Hann,160.0,152.0,94.0,NaN,NaN,776.0,0.0,87.0,0.0,NaN,6.0,0.0,29.0,59.0,13279.0,2015.0
Aaron Schneider,13000.0,3000.0,970.0,2.35,7500000.0,19330.0,11.0,100.0,1.0,9176553.0,7.1,0.0,160.0,97.0,19147.0,2009.0
Aaron Seltzer,3000.0,869.0,729.0,1.85,20000000.0,6539.0,64.0,85.0,0.0,48546578.0,2.7,806.0,99.0,613.0,50415.0,2006.0
Abel Ferrara,812.0,787.0,599.0,1.85,12500000.0,3337.0,220.0,99.0,3.0,1227324.0,6.6,344.0,48.0,48.0,6921.0,1996.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Zoran Lisinac,431.0,297.0,142.0,1.85,250000.0,1087.0,0.0,108.0,3.0,NaN,7.1,231.0,17.0,2.0,330.0,2013.0
Álex de la Iglesia,439.0,161.0,102.0,2.35,10000000.0,940.0,275.0,104.0,4.0,3607.0,6.1,0.0,71.0,94.0,22753.0,2008.0
Émile Gaudreault,636.0,210.0,71.0,1.85,5000000.0,1033.0,9.0,92.0,0.0,6239558.0,6.7,352.0,67.0,67.0,5548.0,2003.0
Éric Tessier,50.0,16.0,6.0,1.85,3200000.0,79.0,0.0,99.0,0.0,NaN,6.6,39.0,9.0,5.0,1003.0,2003.0
Étienne Faure,19.0,0.0,0.0,1.78,500000.0,19.0,77.0,98.0,0.0,NaN,4.3,114.0,9.0,1.0,569.0,2015.0

In [156]:
# 只看关注信息，values

In [157]:
pd.pivot_table(df, index=['director_name'], values=['budget', 'gross'])

                        budget       gross
director_name
A. Raven Cruz        1000000.0         NaN
Aaron Schneider      7500000.0   9176553.0
Aaron Seltzer       20000000.0  48546578.0
Abel Ferrara        12500000.0   1227324.0
Adam Brooks                NaN  31973840.0
...                        ...         ...
Zoran Lisinac         250000.0         NaN
Álex de la Iglesia  10000000.0      3607.0
Émile Gaudreault     5000000.0   6239558.0
Éric Tessier         3200000.0         NaN
Étienne Faure         500000.0         NaN

[2295 rows x 2 columns]

In [159]:
# 和演员的关系

In [160]:
df.columns

Index(['color', 'director_name', 'num_critic_for_reviews', 'duration',
       'director_facebook_likes', 'actor_3_facebook_likes', 'actor_2_name',
       'actor_1_facebook_likes', 'gross', 'genres', 'actor_1_name',
       'movie_title', 'num_voted_users', 'cast_total_facebook_likes',
       'actor_3_name', 'facenumber_in_poster', 'plot_keywords',
       'movie_imdb_link', 'num_user_for_reviews', 'language', 'country',
       'content_rating', 'budget', 'title_year', 'actor_2_facebook_likes',
       'imdb_score', 'aspect_ratio', 'movie_facebook_likes'],
      dtype='object')

In [162]:
# df['actor_1_name'].head()
pd.pivot_table(df, index=['director_name', 'actor_1_name'], values=['budget', 'gross'])

                                            budget       gross
director_name      actor_1_name
A. Raven Cruz      Scott Levy            1000000.0         NaN
Aaron Schneider    Bill Murray           7500000.0   9176553.0
Aaron Seltzer      Alyson Hannigan      20000000.0  48546578.0
Abel Ferrara       Isabella Rossellini  12500000.0   1227324.0
Adam Brooks        Ryan Reynolds               NaN  31973840.0
...                                            ...         ...
Zoran Lisinac      Matthew Emerick        250000.0         NaN
Álex de la Iglesia Jim Carter           10000000.0      3607.0
Émile Gaudreault   Paul Sorvino          5000000.0   6239558.0
Éric Tessier       Patrick Huard         3200000.0         NaN
Étienne Faure      Rumi Missabu           500000.0         NaN

[4404 rows x 2 columns]